# Используем официальный образ Go
FROM golang:1.22 AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы модуля и зависимостей
COPY go.mod go.sum ./
RUN go mod download

# Копируем все файлы приложения в контейнер
COPY . .

# Компилируем приложение
RUN go build -o main ./cmd

# Используем более легкий образ для запуска приложения
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем скомпилированное приложение из образа builder
COPY --from=builder /app/main .

# Открываем порт, который будет использоваться приложением
EXPOSE 8080

# Команда для запуска приложения
CMD ["./main"]

